app/views/records/index.haml

SELECT "tags".* FROM "tags" INNER JOIN "recordTags" ON "tags"."tagID" = "recordTags"."tagIDOrInvalid" WHERE "recordTags"."recordID" = ?  [["recordID", 1716]]
---
        %td
          - record.tags.each do |tag|

SELECT  "groups".* FROM "groups" WHERE "groups"."groupID" = ? LIMIT 1  [["groupID", 1]]
---
        %td
          = record.group.presence