app/controllers/accounts_controller.rb

SELECT "accountGroups".* FROM "accountGroups" WHERE "accountGroups"."accountGroupID" IN (1, 2)
SELECT "accounts".* FROM "accounts"  ORDER BY "accounts"."accountGroupIDOrInvalid" ASC, "accounts"."accountOrder" ASC
SELECT "currencies".* FROM "currencies" WHERE "currencies"."currencyID" IN (20, 121, 13, 91)
---
  def index
    @accounts = Account.includes({balances: :currency}, :account_group).order(:accountGroupIDOrInvalid, :accountOrder)