app/controllers/records_controller.rb

  def index
    @records = Record.includes(
      :source_account,
      :target_account,
      :source_currency,
      :source_currency_foreign,
      :target_currency,
      :target_currency_foreign,
      :tags,
      :group
      ).order(gmtDate: :desc, gmtTime: :desc).page params[:page]
---
SELECT  "records".* FROM "records"  ORDER BY "records"."gmtDate" DESC, "records"."gmtTime" DESC LIMIT 25 OFFSET 0
SELECT "accounts".* FROM "accounts" WHERE "accounts"."accountID" IN (6, 7)
SELECT "currencies".* FROM "currencies" WHERE "currencies"."currencyID" IN (20, 13)
SELECT "groups".* FROM "groups" WHERE "groups"."groupID" IN (1)