app/views/accounts/index.haml

      %tr
        %th{colspan: 2, class: 'text-center'}= accounts.first.account_group.name
---
SELECT "accountGroups".* FROM "accountGroups" WHERE "accountGroups"."accountGroupID" IN (1, 2)